yuplus/nxp-mcx-series/MCXE247/periph0/PERI_ADC.h
/*
** ###################################################################
**     Processors:          MCXE247VLL
**                          MCXE247VLQ
**
**     Version:             rev. 1.0, 2025-02-21
**     Build:               b250417
**
**     Abstract:
**         CMSIS Peripheral Access Layer for ADC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2025-02-21)
**         Generated based on Rev1 Draft RM..
**
** ###################################################################
*/

/*!
 * @file PERI_ADC.h
 * @version 1.0
 * @date 2025-02-21
 * @brief CMSIS Peripheral Access Layer for ADC
 *
 * CMSIS Peripheral Access Layer for ADC
 */

#if !defined(PERI_ADC_H_)
#define PERI_ADC_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE247VLL) || defined(CPU_MCXE247VLQ))
#include "MCXE247_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */

/** ADC - Size of Registers Arrays */
#define ADC_SC1_COUNT                             32u
#define ADC_R_COUNT                               32u

/** ADC - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC1A;                              /**< ADC Status and Control Register 1, offset: 0x0 */
  __IO uint32_t SC1B;                              /**< ADC Status and Control Register 1, offset: 0x4 */
  __IO uint32_t SC1C;                              /**< ADC Status and Control Register 1, offset: 0x8 */
  __IO uint32_t SC1D;                              /**< ADC Status and Control Register 1, offset: 0xC */
  __IO uint32_t SC1E;                              /**< ADC Status and Control Register 1, offset: 0x10 */
  __IO uint32_t SC1F;                              /**< ADC Status and Control Register 1, offset: 0x14 */
  __IO uint32_t SC1G;                              /**< ADC Status and Control Register 1, offset: 0x18 */
  __IO uint32_t SC1H;                              /**< ADC Status and Control Register 1, offset: 0x1C */
  __IO uint32_t SC1I;                              /**< ADC Status and Control Register 1, offset: 0x20 */
  __IO uint32_t SC1J;                              /**< ADC Status and Control Register 1, offset: 0x24 */
  __IO uint32_t SC1K;                              /**< ADC Status and Control Register 1, offset: 0x28 */
  __IO uint32_t SC1L;                              /**< ADC Status and Control Register 1, offset: 0x2C */
  __IO uint32_t SC1M;                              /**< ADC Status and Control Register 1, offset: 0x30 */
  __IO uint32_t SC1N;                              /**< ADC Status and Control Register 1, offset: 0x34 */
  __IO uint32_t SC1O;                              /**< ADC Status and Control Register 1, offset: 0x38 */
  __IO uint32_t SC1P;                              /**< ADC Status and Control Register 1, offset: 0x3C */
  __IO uint32_t CFG1;                              /**< ADC Configuration Register 1, offset: 0x40 */
  __IO uint32_t CFG2;                              /**< ADC Configuration Register 2, offset: 0x44 */
  __I  uint32_t RA;                                /**< ADC Data Result Registers, offset: 0x48 */
  __I  uint32_t RB;                                /**< ADC Data Result Registers, offset: 0x4C */
  __I  uint32_t RC;                                /**< ADC Data Result Registers, offset: 0x50 */
  __I  uint32_t RD;                                /**< ADC Data Result Registers, offset: 0x54 */
  __I  uint32_t RE;                                /**< ADC Data Result Registers, offset: 0x58 */
  __I  uint32_t RF;                                /**< ADC Data Result Registers, offset: 0x5C */
  __I  uint32_t RG;                                /**< ADC Data Result Registers, offset: 0x60 */
  __I  uint32_t RH;                                /**< ADC Data Result Registers, offset: 0x64 */
  __I  uint32_t RI;                                /**< ADC Data Result Registers, offset: 0x68 */
  __I  uint32_t RJ;                                /**< ADC Data Result Registers, offset: 0x6C */
  __I  uint32_t RK;                                /**< ADC Data Result Registers, offset: 0x70 */
  __I  uint32_t RL;                                /**< ADC Data Result Registers, offset: 0x74 */
  __I  uint32_t RM;                                /**< ADC Data Result Registers, offset: 0x78 */
  __I  uint32_t RN;                                /**< ADC Data Result Registers, offset: 0x7C */
  __I  uint32_t RO;                                /**< ADC Data Result Registers, offset: 0x80 */
  __I  uint32_t RP;                                /**< ADC Data Result Registers, offset: 0x84 */
  __IO uint32_t CV1;                               /**< Compare Value Registers, offset: 0x88 */
  __IO uint32_t CV2;                               /**< Compare Value Registers, offset: 0x8C */
  __IO uint32_t SC2;                               /**< Status and Control Register 2, offset: 0x90 */
  __IO uint32_t SC3;                               /**< Status and Control Register 3, offset: 0x94 */
  __IO uint32_t BASE_OFS;                          /**< BASE Offset Register, offset: 0x98 */
  __IO uint32_t OFS;                               /**< ADC Offset Correction Register, offset: 0x9C */
  __IO uint32_t USR_OFS;                           /**< USER Offset Correction Register, offset: 0xA0 */
  __IO uint32_t XOFS;                              /**< ADC X Offset Correction Register, offset: 0xA4 */
  __IO uint32_t YOFS;                              /**< ADC Y Offset Correction Register, offset: 0xA8 */
  __IO uint32_t GAIN;                              /**< ADC Gain Register, offset: 0xAC */
  __IO uint32_t UG;                                /**< ADC User Gain Register, offset: 0xB0 */
  __IO uint32_t CLPS;                              /**< ADC General Calibration Value Register S, offset: 0xB4 */
  __IO uint32_t CLP3;                              /**< ADC Plus-Side General Calibration Value Register 3, offset: 0xB8 */
  __IO uint32_t CLP2;                              /**< ADC Plus-Side General Calibration Value Register 2, offset: 0xBC */
  __IO uint32_t CLP1;                              /**< ADC Plus-Side General Calibration Value Register 1, offset: 0xC0 */
  __IO uint32_t CLP0;                              /**< ADC Plus-Side General Calibration Value Register 0, offset: 0xC4 */
  __IO uint32_t CLPX;                              /**< ADC Plus-Side General Calibration Value Register X, offset: 0xC8 */
  __IO uint32_t CLP9;                              /**< ADC Plus-Side General Calibration Value Register 9, offset: 0xCC */
  __IO uint32_t CLPS_OFS;                          /**< ADC General Calibration Offset Value Register S, offset: 0xD0 */
  __IO uint32_t CLP3_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 3, offset: 0xD4 */
  __IO uint32_t CLP2_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 2, offset: 0xD8 */
  __IO uint32_t CLP1_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 1, offset: 0xDC */
  __IO uint32_t CLP0_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 0, offset: 0xE0 */
  __IO uint32_t CLPX_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register X, offset: 0xE4 */
  __IO uint32_t CLP9_OFS;                          /**< ADC Plus-Side General Calibration Offset Value Register 9, offset: 0xE8 */
       uint8_t RESERVED_0[28];
  __IO uint32_t SC1[ADC_SC1_COUNT];                /**< ADC Status and Control Register 1, array offset: 0x108, array step: 0x4 */
  __I  uint32_t R[ADC_R_COUNT];                    /**< ADC Data Result Registers, array offset: 0x188, array step: 0x4 */
} ADC_Type;

/* ----------------------------------------------------------------------------
   -- ADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Register_Masks ADC Register Masks
 * @{
 */

/*! @name SC1A - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1A_ADCH_MASK                       (0x3FU)
#define ADC_SC1A_ADCH_SHIFT                      (0U)
/*! ADCH - Input channel select
 *  0b000000..External channel 0 is selected as input.
 *  0b000001..External channel 1 is selected as input.
 *  0b000010..External channel 2 is selected as input.
 *  0b000011..External channel 3 is selected as input.
 *  0b000100..External channel 4 is selected as input.
 *  0b000101..External channel 5 is selected as input.
 *  0b000110..External channel 6 is selected as input.
 *  0b000111..External channel 7 is selected as input.
 *  0b001000..External channel 8 is selected as input.
 *  0b001001..External channel 9 is selected as input.
 *  0b001010..External channel 10 is selected as input.
 *  0b001011..External channel 11 is selected as input.
 *  0b001100..External channel 12 is selected as input.
 *  0b001101..External channel 13 is selected as input.
 *  0b001110..External channel 14 is selected as input.
 *  0b001111..External channel 15 is selected as input.
 *  0b010000..Reserved
 *  0b010001..Reserved
 *  0b010010..Reserved
 *  0b010011..Reserved
 *  0b010100..Reserved
 *  0b010101..Internal channel 0 is selected as input.
 *  0b010110..Internal channel 1 is selected as input.
 *  0b010111..Internal channel 2 is selected as input.
 *  0b011000..Reserved
 *  0b011001..Reserved
 *  0b011010..Reserved
 *  0b011011..Band Gap
 *  0b011100..Internal channel 3 is selected as input.
 *  0b011101..VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011110..VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011111..Reserved
 *  0b100000..External channel 16 is selected as input.
 *  0b100001..External channel 17 is selected as input.
 *  0b100010..External channel 18 is selected as input.
 *  0b100011..External channel 19 is selected as input.
 *  0b100100..External channel 20 is selected as input.
 *  0b100101..External channel 21 is selected as input.
 *  0b100110..External channel 22 is selected as input.
 *  0b100111..External channel 23 is selected as input.
 *  0b101000..External channel 24 is selected as input.
 *  0b101001..External channel 25 is selected as input.
 *  0b101010..External channel 26 is selected as input.
 *  0b101011..External channel 27 is selected as input.
 *  0b101100..External channel 28 is selected as input.
 *  0b101101..External channel 29 is selected as input.
 *  0b101110..External channel 30 is selected as input.
 *  0b101111..External channel 31 is selected as input.
 *  0b110000..Reserved
 *  0b110001..Reserved
 *  0b110010..Reserved
 *  0b110011..Reserved
 *  0b110100..Reserved
 *  0b110101..Reserved
 *  0b110110..Reserved
 *  0b110111..Reserved
 *  0b111000..Reserved
 *  0b111001..Reserved
 *  0b111010..Reserved
 *  0b111011..Reserved
 *  0b111100..Reserved
 *  0b111101..Reserved
 *  0b111110..Reserved
 *  0b111111..Reserved
 */
#define ADC_SC1A_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_ADCH_SHIFT)) & ADC_SC1A_ADCH_MASK)

#define ADC_SC1A_AIEN_MASK                       (0x40U)
#define ADC_SC1A_AIEN_SHIFT                      (6U)
/*! AIEN - Interrupt Enable
 *  0b0..Conversion complete interrupt is disabled.
 *  0b1..Conversion complete interrupt is enabled.
 */
#define ADC_SC1A_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_AIEN_SHIFT)) & ADC_SC1A_AIEN_MASK)

#define ADC_SC1A_COCO_MASK                       (0x80U)
#define ADC_SC1A_COCO_SHIFT                      (7U)
/*! COCO - Conversion Complete Flag
 *  0b0..Conversion is not completed.
 *  0b1..Conversion is completed.
 */
#define ADC_SC1A_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1A_COCO_SHIFT)) & ADC_SC1A_COCO_MASK)
/*! @} */

/*! @name SC1B - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1B_ADCH_MASK                       (0x3FU)
#define ADC_SC1B_ADCH_SHIFT                      (0U)
/*! ADCH - Input channel select
 *  0b000000..External channel 0 is selected as input.
 *  0b000001..External channel 1 is selected as input.
 *  0b000010..External channel 2 is selected as input.
 *  0b000011..External channel 3 is selected as input.
 *  0b000100..External channel 4 is selected as input.
 *  0b000101..External channel 5 is selected as input.
 *  0b000110..External channel 6 is selected as input.
 *  0b000111..External channel 7 is selected as input.
 *  0b001000..External channel 8 is selected as input.
 *  0b001001..External channel 9 is selected as input.
 *  0b001010..External channel 10 is selected as input.
 *  0b001011..External channel 11 is selected as input.
 *  0b001100..External channel 12 is selected as input.
 *  0b001101..External channel 13 is selected as input.
 *  0b001110..External channel 14 is selected as input.
 *  0b001111..External channel 15 is selected as input.
 *  0b010000..Reserved
 *  0b010001..Reserved
 *  0b010010..Reserved
 *  0b010011..Reserved
 *  0b010100..Reserved
 *  0b010101..Internal channel 0 is selected as input.
 *  0b010110..Internal channel 1 is selected as input.
 *  0b010111..Internal channel 2 is selected as input.
 *  0b011000..Reserved
 *  0b011001..Reserved
 *  0b011010..Reserved
 *  0b011011..Band Gap
 *  0b011100..Internal channel 3 is selected as input.
 *  0b011101..VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011110..VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011111..Reserved
 *  0b100000..External channel 16 is selected as input.
 *  0b100001..External channel 17 is selected as input.
 *  0b100010..External channel 18 is selected as input.
 *  0b100011..External channel 19 is selected as input.
 *  0b100100..External channel 20 is selected as input.
 *  0b100101..External channel 21 is selected as input.
 *  0b100110..External channel 22 is selected as input.
 *  0b100111..External channel 23 is selected as input.
 *  0b101000..External channel 24 is selected as input.
 *  0b101001..External channel 25 is selected as input.
 *  0b101010..External channel 26 is selected as input.
 *  0b101011..External channel 27 is selected as input.
 *  0b101100..External channel 28 is selected as input.
 *  0b101101..External channel 29 is selected as input.
 *  0b101110..External channel 30 is selected as input.
 *  0b101111..External channel 31 is selected as input.
 *  0b110000..Reserved
 *  0b110001..Reserved
 *  0b110010..Reserved
 *  0b110011..Reserved
 *  0b110100..Reserved
 *  0b110101..Reserved
 *  0b110110..Reserved
 *  0b110111..Reserved
 *  0b111000..Reserved
 *  0b111001..Reserved
 *  0b111010..Reserved
 *  0b111011..Reserved
 *  0b111100..Reserved
 *  0b111101..Reserved
 *  0b111110..Reserved
 *  0b111111..Reserved
 */
#define ADC_SC1B_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1B_ADCH_SHIFT)) & ADC_SC1B_ADCH_MASK)

#define ADC_SC1B_AIEN_MASK                       (0x40U)
#define ADC_SC1B_AIEN_SHIFT                      (6U)
/*! AIEN - Interrupt Enable
 *  0b0..Conversion complete interrupt is disabled.
 *  0b1..Conversion complete interrupt is enabled.
 */
#define ADC_SC1B_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1B_AIEN_SHIFT)) & ADC_SC1B_AIEN_MASK)

