yuplus/nxp-mcx-series/MCXE247/periph0/PERI_ADC.h
/*! @name SC1P - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1P_ADCH_MASK                       (0x3FU)
#define ADC_SC1P_ADCH_SHIFT                      (0U)
/*! ADCH - Input channel select
 *  0b000000..External channel 0 is selected as input.
 *  0b000001..External channel 1 is selected as input.
 *  0b000010..External channel 2 is selected as input.
 *  0b000011..External channel 3 is selected as input.
 *  0b000100..External channel 4 is selected as input.
 *  0b000101..External channel 5 is selected as input.
 *  0b000110..External channel 6 is selected as input.
 *  0b000111..External channel 7 is selected as input.
 *  0b001000..External channel 8 is selected as input.
 *  0b001001..External channel 9 is selected as input.
 *  0b001010..External channel 10 is selected as input.
 *  0b001011..External channel 11 is selected as input.
 *  0b001100..External channel 12 is selected as input.
 *  0b001101..External channel 13 is selected as input.
 *  0b001110..External channel 14 is selected as input.
 *  0b001111..External channel 15 is selected as input.
 *  0b010000..Reserved
 *  0b010001..Reserved
 *  0b010010..Reserved
 *  0b010011..Reserved
 *  0b010100..Reserved
 *  0b010101..Internal channel 0 is selected as input.
 *  0b010110..Internal channel 1 is selected as input.
 *  0b010111..Internal channel 2 is selected as input.
 *  0b011000..Reserved
 *  0b011001..Reserved
 *  0b011010..Reserved
 *  0b011011..Band Gap
 *  0b011100..Internal channel 3 is selected as input.
 *  0b011101..VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011110..VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].
 *  0b011111..Reserved
 *  0b100000..External channel 16 is selected as input.
 *  0b100001..External channel 17 is selected as input.
 *  0b100010..External channel 18 is selected as input.
 *  0b100011..External channel 19 is selected as input.
 *  0b100100..External channel 20 is selected as input.
 *  0b100101..External channel 21 is selected as input.
 *  0b100110..External channel 22 is selected as input.
 *  0b100111..External channel 23 is selected as input.
 *  0b101000..External channel 24 is selected as input.
 *  0b101001..External channel 25 is selected as input.
 *  0b101010..External channel 26 is selected as input.
 *  0b101011..External channel 27 is selected as input.
 *  0b101100..External channel 28 is selected as input.
 *  0b101101..External channel 29 is selected as input.
 *  0b101110..External channel 30 is selected as input.
 *  0b101111..External channel 31 is selected as input.
 *  0b110000..Reserved
 *  0b110001..Reserved
 *  0b110010..Reserved
 *  0b110011..Reserved
 *  0b110100..Reserved
 *  0b110101..Reserved
 *  0b110110..Reserved
 *  0b110111..Reserved
 *  0b111000..Reserved
 *  0b111001..Reserved
 *  0b111010..Reserved
 *  0b111011..Reserved
 *  0b111100..Reserved
 *  0b111101..Reserved
 *  0b111110..Reserved
 *  0b111111..Reserved
 */
#define ADC_SC1P_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_ADCH_SHIFT)) & ADC_SC1P_ADCH_MASK)

#define ADC_SC1P_AIEN_MASK                       (0x40U)
#define ADC_SC1P_AIEN_SHIFT                      (6U)
/*! AIEN - Interrupt Enable
 *  0b0..Conversion complete interrupt is disabled.
 *  0b1..Conversion complete interrupt is enabled.
 */
#define ADC_SC1P_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_AIEN_SHIFT)) & ADC_SC1P_AIEN_MASK)

#define ADC_SC1P_COCO_MASK                       (0x80U)
#define ADC_SC1P_COCO_SHIFT                      (7U)
/*! COCO - Conversion Complete Flag
 *  0b0..Conversion is not completed.
 *  0b1..Conversion is completed.
 */
#define ADC_SC1P_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_COCO_SHIFT)) & ADC_SC1P_COCO_MASK)
/*! @} */

/*! @name CFG1 - ADC Configuration Register 1 */
/*! @{ */

#define ADC_CFG1_ADICLK_MASK                     (0x3U)
#define ADC_CFG1_ADICLK_SHIFT                    (0U)
/*! ADICLK - Input Clock Select
 *  0b00..Alternate clock 1 (ALTCLK1)
 *  0b01..Alternate clock 2 (ALTCLK2)
 *  0b10..Alternate clock 3 (ALTCLK3)
 *  0b11..Alternate clock 4 (ALTCLK4)
 */
#define ADC_CFG1_ADICLK(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_ADICLK_SHIFT)) & ADC_CFG1_ADICLK_MASK)

#define ADC_CFG1_MODE_MASK                       (0xCU)
#define ADC_CFG1_MODE_SHIFT                      (2U)
/*! MODE - Conversion mode selection
 *  0b00..8-bit conversion.
 *  0b01..12-bit conversion.
 *  0b10..10-bit conversion.
 *  0b11..Reserved
 */
#define ADC_CFG1_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_MODE_SHIFT)) & ADC_CFG1_MODE_MASK)

#define ADC_CFG1_ADIV_MASK                       (0x60U)
#define ADC_CFG1_ADIV_SHIFT                      (5U)
/*! ADIV - Clock Divide Select
 *  0b00..The divide ratio is 1 and the clock rate is input clock.
 *  0b01..The divide ratio is 2 and the clock rate is (input clock)/2.
 *  0b10..The divide ratio is 4 and the clock rate is (input clock)/4.
 *  0b11..The divide ratio is 8 and the clock rate is (input clock)/8.
 */
#define ADC_CFG1_ADIV(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_ADIV_SHIFT)) & ADC_CFG1_ADIV_MASK)

#define ADC_CFG1_CLRLTRG_MASK                    (0x100U)
#define ADC_CFG1_CLRLTRG_SHIFT                   (8U)
/*! CLRLTRG - Clear Latch Trigger in Trigger Handler Block */
#define ADC_CFG1_CLRLTRG(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_CLRLTRG_SHIFT)) & ADC_CFG1_CLRLTRG_MASK)
/*! @} */

/*! @name CFG2 - ADC Configuration Register 2 */
/*! @{ */

#define ADC_CFG2_SMPLTS_MASK                     (0xFFU)
#define ADC_CFG2_SMPLTS_SHIFT                    (0U)
/*! SMPLTS - Sample Time Select */
#define ADC_CFG2_SMPLTS(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_CFG2_SMPLTS_SHIFT)) & ADC_CFG2_SMPLTS_MASK)
/*! @} */

/*! @name RA - ADC Data Result Registers */
/*! @{ */

#define ADC_RA_D_MASK                            (0xFFFU)
#define ADC_RA_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RA_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RA_D_SHIFT)) & ADC_RA_D_MASK)
/*! @} */

/*! @name RB - ADC Data Result Registers */
/*! @{ */

#define ADC_RB_D_MASK                            (0xFFFU)
#define ADC_RB_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RB_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RB_D_SHIFT)) & ADC_RB_D_MASK)
/*! @} */

/*! @name RC - ADC Data Result Registers */
/*! @{ */

#define ADC_RC_D_MASK                            (0xFFFU)
#define ADC_RC_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RC_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RC_D_SHIFT)) & ADC_RC_D_MASK)
/*! @} */

/*! @name RD - ADC Data Result Registers */
/*! @{ */

#define ADC_RD_D_MASK                            (0xFFFU)
#define ADC_RD_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RD_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RD_D_SHIFT)) & ADC_RD_D_MASK)
/*! @} */

