yuplus/nxp-mcx-series/MCXE247/periph0/PERI_ADC.h
/*! @name RE - ADC Data Result Registers */
/*! @{ */

#define ADC_RE_D_MASK                            (0xFFFU)
#define ADC_RE_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RE_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RE_D_SHIFT)) & ADC_RE_D_MASK)
/*! @} */

/*! @name RF - ADC Data Result Registers */
/*! @{ */

#define ADC_RF_D_MASK                            (0xFFFU)
#define ADC_RF_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RF_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RF_D_SHIFT)) & ADC_RF_D_MASK)
/*! @} */

/*! @name RG - ADC Data Result Registers */
/*! @{ */

#define ADC_RG_D_MASK                            (0xFFFU)
#define ADC_RG_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RG_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RG_D_SHIFT)) & ADC_RG_D_MASK)
/*! @} */

/*! @name RH - ADC Data Result Registers */
/*! @{ */

#define ADC_RH_D_MASK                            (0xFFFU)
#define ADC_RH_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RH_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RH_D_SHIFT)) & ADC_RH_D_MASK)
/*! @} */

/*! @name RI - ADC Data Result Registers */
/*! @{ */

#define ADC_RI_D_MASK                            (0xFFFU)
#define ADC_RI_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RI_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RI_D_SHIFT)) & ADC_RI_D_MASK)
/*! @} */

/*! @name RJ - ADC Data Result Registers */
/*! @{ */

#define ADC_RJ_D_MASK                            (0xFFFU)
#define ADC_RJ_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RJ_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RJ_D_SHIFT)) & ADC_RJ_D_MASK)
/*! @} */

/*! @name RK - ADC Data Result Registers */
/*! @{ */

#define ADC_RK_D_MASK                            (0xFFFU)
#define ADC_RK_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RK_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RK_D_SHIFT)) & ADC_RK_D_MASK)
/*! @} */

/*! @name RL - ADC Data Result Registers */
/*! @{ */

#define ADC_RL_D_MASK                            (0xFFFU)
#define ADC_RL_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RL_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RL_D_SHIFT)) & ADC_RL_D_MASK)
/*! @} */

/*! @name RM - ADC Data Result Registers */
/*! @{ */

#define ADC_RM_D_MASK                            (0xFFFU)
#define ADC_RM_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RM_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RM_D_SHIFT)) & ADC_RM_D_MASK)
/*! @} */

/*! @name RN - ADC Data Result Registers */
/*! @{ */

#define ADC_RN_D_MASK                            (0xFFFU)
#define ADC_RN_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RN_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RN_D_SHIFT)) & ADC_RN_D_MASK)
/*! @} */

/*! @name RO - ADC Data Result Registers */
/*! @{ */

#define ADC_RO_D_MASK                            (0xFFFU)
#define ADC_RO_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RO_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RO_D_SHIFT)) & ADC_RO_D_MASK)
/*! @} */

/*! @name RP - ADC Data Result Registers */
/*! @{ */

#define ADC_RP_D_MASK                            (0xFFFU)
#define ADC_RP_D_SHIFT                           (0U)
/*! D - Data result */
#define ADC_RP_D(x)                              (((uint32_t)(((uint32_t)(x)) << ADC_RP_D_SHIFT)) & ADC_RP_D_MASK)
/*! @} */

/*! @name CV1 - Compare Value Registers */
/*! @{ */

#define ADC_CV1_CV_MASK                          (0xFFFFU)
#define ADC_CV1_CV_SHIFT                         (0U)
/*! CV - Compare Value. */
#define ADC_CV1_CV(x)                            (((uint32_t)(((uint32_t)(x)) << ADC_CV1_CV_SHIFT)) & ADC_CV1_CV_MASK)
/*! @} */

/*! @name CV2 - Compare Value Registers */
/*! @{ */

#define ADC_CV2_CV_MASK                          (0xFFFFU)
#define ADC_CV2_CV_SHIFT                         (0U)
/*! CV - Compare Value. */
#define ADC_CV2_CV(x)                            (((uint32_t)(((uint32_t)(x)) << ADC_CV2_CV_SHIFT)) & ADC_CV2_CV_MASK)
/*! @} */

/*! @name SC2 - Status and Control Register 2 */
/*! @{ */

#define ADC_SC2_REFSEL_MASK                      (0x3U)
#define ADC_SC2_REFSEL_SHIFT                     (0U)
/*! REFSEL - Voltage Reference Selection
 *  0b00..Default voltage reference pin pair, that is, external pins VREFH and VREFL
 *  0b01..Alternate reference voltage, that is, VALTH. This voltage may be additional external pin or internal
 *        source depending on the MCU configuration. See the chip configuration information for details specific to
 *        this MCU.
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define ADC_SC2_REFSEL(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_SC2_REFSEL_SHIFT)) & ADC_SC2_REFSEL_MASK)

#define ADC_SC2_DMAEN_MASK                       (0x4U)
#define ADC_SC2_DMAEN_SHIFT                      (2U)
/*! DMAEN - DMA Enable
 *  0b0..DMA is disabled.
 *  0b1..DMA is enabled and will assert the ADC DMA request during an ADC conversion complete event , which is
 *       indicated when any SC1n[COCO] flag is asserted.
 */
#define ADC_SC2_DMAEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC2_DMAEN_SHIFT)) & ADC_SC2_DMAEN_MASK)

#define ADC_SC2_ACREN_MASK                       (0x8U)
#define ADC_SC2_ACREN_SHIFT                      (3U)
/*! ACREN - Compare Function Range Enable */
#define ADC_SC2_ACREN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC2_ACREN_SHIFT)) & ADC_SC2_ACREN_MASK)

